bloombloombloom/Bloom/src/Targets/Microchip/AVR/PartDescriptionFiles/AVR8/MEGA/ATMEGA2564RFR2.xml
<?xml version="1.0" encoding="UTF-8"?>
<part-description-file>
    <variants>
        <variant ordercode="ATmega2564RFR2-ZU" package="VQFN48" speedmax="16000000" tempmax="85" tempmin="-40"
                 vccmax="3.6" vccmin="1.8"/>
        <variant ordercode="ATmega2564RFR2-ZUR" package="VQFN48" speedmax="16000000" tempmax="85" tempmin="-40"
                 vccmax="3.6" vccmin="1.8"/>
        <variant ordercode="ATmega2564RFR2-ZF" package="VQFN48" speedmax="16000000" tempmax="125" tempmin="-40"
                 vccmax="3.6" vccmin="1.8"/>
        <variant ordercode="ATmega2564RFR2-ZFR" package="VQFN48" speedmax="16000000" tempmax="125" tempmin="-40"
                 vccmax="3.6" vccmin="1.8"/>
    </variants>
    <devices>
        <device name="ATmega2564RFR2" architecture="AVR8" family="megaAVR">
            <address-spaces>
                <address-space endianness="little" name="prog" id="prog" start="0x0000" size="0x40000">
                    <memory-segment start="0x0000" size="0x40000" type="flash" rw="RW" exec="1" name="FLASH"
                                    pagesize="0x100"/>
                    <memory-segment start="0x3fc00" size="0x0400" type="flash" rw="RW" exec="1" name="BOOT_SECTION_1"
                                    pagesize="0x100"/>
                    <memory-segment start="0x3f800" size="0x0800" type="flash" rw="RW" exec="1" name="BOOT_SECTION_2"
                                    pagesize="0x100"/>
                    <memory-segment start="0x3f000" size="0x1000" type="flash" rw="RW" exec="1" name="BOOT_SECTION_3"
                                    pagesize="0x100"/>
                    <memory-segment start="0x3e000" size="0x2000" type="flash" rw="RW" exec="1" name="BOOT_SECTION_4"
                                    pagesize="0x100"/>
                </address-space>
                <address-space endianness="little" name="signatures" id="signatures" start="0" size="3">
                    <memory-segment start="0" size="3" type="signatures" rw="R" exec="0" name="SIGNATURES"/>
                </address-space>
                <address-space endianness="little" name="fuses" id="fuses" start="0" size="0x0003">
                    <memory-segment start="0" size="0x0003" type="fuses" rw="RW" exec="0" name="FUSES"/>
                </address-space>
                <address-space endianness="little" name="lockbits" id="lockbits" start="0" size="0x0001">
                    <memory-segment start="0" size="0x0001" type="lockbits" rw="RW" exec="0" name="LOCKBITS"/>
                </address-space>
                <address-space endianness="little" name="user_signatures" id="user_signatures" start="0x0100"
                               size="0x0300">
                    <memory-segment start="0x0100" size="0x0300" type="user_signatures" rw="RW" exec="0"
                                    name="USER_SIGNATURES" pagesize="0x100"/>
                </address-space>
                <address-space endianness="little" name="data" id="data" start="0x0000" size="0x8200">
                    <memory-segment external="false" type="regs" size="0x0020" start="0x0000" name="REGISTERS"/>
                    <memory-segment name="MAPPED_IO" start="0x0020" size="0x01e0" type="io" external="false"/>
                    <memory-segment name="IRAM" start="0x0200" size="0x8000" type="ram" external="false"/>
                </address-space>
                <address-space endianness="little" name="eeprom" id="eeprom" start="0x0000" size="0x2000">
                    <memory-segment start="0x0000" size="0x2000" type="eeprom" rw="RW" exec="0" name="EEPROM"
                                    pagesize="0x08"/>
                </address-space>
                <address-space size="0x40" start="0x00" endianness="little" name="io" id="io"/>
                <address-space endianness="little" name="osccal" id="osccal" start="0" size="1">
                    <memory-segment start="0" size="1" type="osccal" rw="R" exec="0" name="OSCCAL"/>
                </address-space>
            </address-spaces>
            <peripherals>
                <module name="AC">
                    <instance name="AC" caption="Analog Comparator">
                        <register-group name="AC" name-in-module="AC" offset="0x00" address-space="data"
                                        caption="Analog Comparator"/>
                    </instance>
                </module>
                <module name="USART">
                    <instance name="USART0" caption="USART">
                        <register-group name="USART0" name-in-module="USART0" offset="0x00" address-space="data"
                                        caption="USART"/>
                    </instance>
                    <instance name="USART1" caption="USART">
                        <register-group name="USART1" name-in-module="USART1" offset="0x00" address-space="data"
                                        caption="USART"/>
                    </instance>
                </module>
                <module name="TWI">
                    <instance name="TWI" caption="Two Wire Serial Interface">
                        <register-group name="TWI" name-in-module="TWI" offset="0x00" address-space="data"
                                        caption="Two Wire Serial Interface"/>
                    </instance>
                </module>
                <module name="SPI">
                    <instance name="SPI" caption="Serial Peripheral Interface">
                        <register-group name="SPI" name-in-module="SPI" offset="0x00" address-space="data"
                                        caption="Serial Peripheral Interface"/>
                    </instance>
                    <instance name="USART0_SPI" caption="Serial Peripheral Interface">
                        <register-group name="USART0_SPI" name-in-module="USART0_SPI" offset="0x00" address-space="data"
                                        caption="Serial Peripheral Interface"/>
                    </instance>
                    <instance name="USART1_SPI" caption="Serial Peripheral Interface">
                        <register-group name="USART1_SPI" name-in-module="USART1_SPI" offset="0x00" address-space="data"
                                        caption="Serial Peripheral Interface"/>
                    </instance>
                </module>
                <module name="PORT">
                    <instance name="PORTA" caption="I/O Port">
                        <register-group name="PORTA" name-in-module="PORTA" offset="0x00" address-space="data"
                                        caption="I/O Port"/>
                    </instance>
                    <instance name="PORTB" caption="I/O Port">
                        <register-group name="PORTB" name-in-module="PORTB" offset="0x00" address-space="data"
                                        caption="I/O Port"/>
                    </instance>
                    <instance name="PORTC" caption="I/O Port">
                        <register-group name="PORTC" name-in-module="PORTC" offset="0x00" address-space="data"
                                        caption="I/O Port"/>
                    </instance>
                    <instance name="PORTD" caption="I/O Port">
                        <register-group name="PORTD" name-in-module="PORTD" offset="0x00" address-space="data"
                                        caption="I/O Port"/>
                    </instance>
                    <instance name="PORTE" caption="I/O Port">
                        <register-group name="PORTE" name-in-module="PORTE" offset="0x00" address-space="data"
                                        caption="I/O Port"/>
                    </instance>
                    <instance name="PORTF" caption="I/O Port">
                        <register-group name="PORTF" name-in-module="PORTF" offset="0x00" address-space="data"
                                        caption="I/O Port"/>
                    </instance>
                    <instance name="PORTG" caption="I/O Port">
                        <register-group name="PORTG" name-in-module="PORTG" offset="0x00" address-space="data"
                                        caption="I/O Port"/>
                    </instance>
                </module>
