bloombloombloom/Bloom/src/Targets/Microchip/AVR/PartDescriptionFiles/AVR8/MEGA/ATMEGA2564RFR2.xml
                <module name="TC8">
                    <instance name="TC0" caption="Timer/Counter, 8-bit">
                        <register-group name="TC0" name-in-module="TC0" offset="0x00" address-space="data"
                                        caption="Timer/Counter, 8-bit"/>
                    </instance>
                </module>
                <module name="TC8_ASYNC">
                    <instance name="TC2" caption="Timer/Counter, 8-bit Async">
                        <register-group name="TC2" name-in-module="TC2" offset="0x00" address-space="data"
                                        caption="Timer/Counter, 8-bit Async"/>
                    </instance>
                </module>
                <module name="WDT">
                    <instance name="WDT" caption="Watchdog Timer">
                        <register-group name="WDT" name-in-module="WDT" offset="0x00" address-space="data"
                                        caption="Watchdog Timer"/>
                    </instance>
                </module>
                <module name="TC16">
                    <instance name="TC5" caption="Timer/Counter, 16-bit">
                        <register-group name="TC5" name-in-module="TC5" offset="0x00" address-space="data"
                                        caption="Timer/Counter, 16-bit"/>
                    </instance>
                    <instance name="TC4" caption="Timer/Counter, 16-bit">
                        <register-group name="TC4" name-in-module="TC4" offset="0x00" address-space="data"
                                        caption="Timer/Counter, 16-bit"/>
                    </instance>
                    <instance name="TC3" caption="Timer/Counter, 16-bit">
                        <register-group name="TC3" name-in-module="TC3" offset="0x00" address-space="data"
                                        caption="Timer/Counter, 16-bit"/>
                    </instance>
                    <instance name="TC1" caption="Timer/Counter, 16-bit">
                        <register-group name="TC1" name-in-module="TC1" offset="0x00" address-space="data"
                                        caption="Timer/Counter, 16-bit"/>
                    </instance>
                </module>
                <module name="TRX24">
                    <instance name="TRX24" caption="Low-Power 2.4 GHz Transceiver">
                        <register-group name="TRX24" name-in-module="TRX24" offset="0x00" address-space="data"
                                        caption="Low-Power 2.4 GHz Transceiver"/>
                    </instance>
                </module>
                <module name="SYMCNT">
                    <instance name="SYMCNT" caption="MAC Symbol Counter">
                        <register-group name="SYMCNT" name-in-module="SYMCNT" offset="0x00" address-space="data"
                                        caption="MAC Symbol Counter"/>
                    </instance>
                </module>
                <module name="EEPROM">
                    <instance name="EEPROM" caption="EEPROM">
                        <register-group name="EEPROM" name-in-module="EEPROM" offset="0x00" address-space="data"
                                        caption="EEPROM"/>
                    </instance>
                </module>
                <module name="JTAG">
                    <instance name="JTAG" caption="JTAG Interface">
                        <register-group name="JTAG" name-in-module="JTAG" offset="0x00" address-space="data"
                                        caption="JTAG Interface"/>
                    </instance>
                </module>
                <module name="EXINT">
                    <instance name="EXINT" caption="External Interrupts">
                        <register-group name="EXINT" name-in-module="EXINT" offset="0x00" address-space="data"
                                        caption="External Interrupts"/>
                    </instance>
                </module>
                <module name="ADC">
                    <instance name="ADC" caption="Analog-to-Digital Converter">
                        <register-group name="ADC" name-in-module="ADC" offset="0x00" address-space="data"
                                        caption="Analog-to-Digital Converter"/>
                    </instance>
                </module>
                <module name="BOOT_LOAD">
                    <instance name="BOOT_LOAD" caption="Bootloader">
                        <register-group name="BOOT_LOAD" name-in-module="BOOT_LOAD" offset="0x00" address-space="data"
                                        caption="Bootloader"/>
                    </instance>
                </module>
                <module name="CPU">
                    <instance name="CPU" caption="CPU Registers">
                        <register-group name="CPU" name-in-module="CPU" offset="0x00" address-space="data"
                                        caption="CPU Registers"/>
                        <parameters>
                            <param name="CORE_VERSION" value="V3"/>
                        </parameters>
                    </instance>
                </module>
                <module name="FLASH">
                    <instance name="FLASH" caption="FLASH Controller">
                        <register-group name="FLASH" name-in-module="FLASH" offset="0x00" address-space="data"
                                        caption="FLASH Controller"/>
                    </instance>
                </module>
                <module name="PWRCTRL">
                    <instance name="PWRCTRL" caption="Power Controller">
                        <register-group name="PWRCTRL" name-in-module="PWRCTRL" offset="0x00" address-space="data"
                                        caption="Power Controller"/>
                    </instance>
                </module>
                <module name="FUSE">
                    <instance name="FUSE" caption="Fuses">
                        <register-group name="FUSE" name-in-module="FUSE" offset="0" address-space="fuses"
                                        caption="Fuses"/>
                    </instance>
                </module>
