bloombloombloom/Bloom/src/Targets/Microchip/AVR/PartDescriptionFiles/AVR8/MEGA/ATMEGA2564RFR2.xml
        <module caption="Serial Peripheral Interface" name="SPI">
            <register-group caption="Serial Peripheral Interface" name="SPI">
                <register caption="SPI Control Register" name="SPCR" offset="0x4C" size="1">
                    <bitfield caption="SPI Interrupt Enable" mask="0x80" name="SPIE"/>
                    <bitfield caption="SPI Enable" mask="0x40" name="SPE"/>
                    <bitfield caption="Data Order" mask="0x20" name="DORD"/>
                    <bitfield caption="Master/Slave Select" mask="0x10" name="MSTR"/>
                    <bitfield caption="Clock polarity" mask="0x08" name="CPOL" values="SPI_CPOL_BITF"/>
                    <bitfield caption="Clock Phase" mask="0x04" name="CPHA" values="SPI_CPHA_BITF"/>
                    <bitfield caption="SPI Clock Rate Select 1 and 0" mask="0x03" name="SPR"
                              values="COMM_SCK_RATE_SPI2X"/>
                </register>
                <register caption="SPI Status Register" name="SPSR" offset="0x4D" size="1" ocd-rw="R">
                    <bitfield caption="SPI Interrupt Flag" mask="0x80" name="SPIF"/>
                    <bitfield caption="Write Collision Flag" mask="0x40" name="WCOL"/>
                    <bitfield caption="Double SPI Speed Bit" mask="0x01" name="SPI2X"/>
                </register>
                <register caption="SPI Data Register" name="SPDR" offset="0x4E" size="1" mask="0xFF" ocd-rw=""/>
            </register-group>
            <register-group caption="Serial Peripheral Interface" name="USART0_SPI">
                <register caption="USART0 MSPIM Control and Status Register A" name="UCSR0A" offset="0xC0" size="1"
                          ocd-rw="R">
                    <bitfield caption="USART Receive Complete" mask="0x80" name="RXC0"/>
                    <bitfield caption="USART Transmit Complete" mask="0x40" name="TXC0"/>
                    <bitfield caption="USART Data Register Empty" mask="0x20" name="UDRE0"/>
                </register>
                <register caption="USART0 MSPIM Control and Status Register B" name="UCSR0B" offset="0xC1" size="1">
                    <bitfield caption="RX Complete Interrupt Enable" mask="0x80" name="RXCIE0"/>
                    <bitfield caption="TX Complete Interrupt Enable" mask="0x40" name="TXCIE0"/>
                    <bitfield caption="USART Data Register Empty Interrupt Enable" mask="0x20" name="UDRIE0"/>
                    <bitfield caption="Receiver Enable" mask="0x10" name="RXEN0"/>
                    <bitfield caption="Transmitter Enable" mask="0x08" name="TXEN0"/>
                </register>
                <register caption="USART0 MSPIM Control and Status Register C" name="UCSR0C" offset="0xC2" size="1">
                    <bitfield caption="Data Order" mask="0x04" name="UDORD0"/>
                    <bitfield caption="Clock Phase" mask="0x02" name="UCPHA0"/>
                    <bitfield caption="Clock Polarity" mask="0x01" name="UCPOL0"/>
                </register>
            </register-group>
            <register-group caption="Serial Peripheral Interface" name="USART1_SPI">
                <register caption="USART1 MSPIM Control and Status Register A" name="UCSR1A" offset="0xC8" size="1"
                          ocd-rw="R">
                    <bitfield caption="USART Receive Complete" mask="0x80" name="RXC1"/>
                    <bitfield caption="USART Transmit Complete" mask="0x40" name="TXC1"/>
                    <bitfield caption="USART Data Register Empty" mask="0x20" name="UDRE1"/>
                </register>
                <register caption="USART1 MSPIM Control and Status Register B" name="UCSR1B" offset="0xC9" size="1">
                    <bitfield caption="RX Complete Interrupt Enable" mask="0x80" name="RXCIE1"/>
                    <bitfield caption="TX Complete Interrupt Enable" mask="0x40" name="TXCIE1"/>
                    <bitfield caption="USART Data Register Empty Interrupt Enable" mask="0x20" name="UDRIE1"/>
                    <bitfield caption="Receiver Enable" mask="0x10" name="RXEN1"/>
                    <bitfield caption="Transmitter Enable" mask="0x08" name="TXEN1"/>
                </register>
                <register caption="USART1 MSPIM Control and Status Register C" name="UCSR1C" offset="0xCA" size="1">
                    <bitfield caption="Data Order" mask="0x04" name="UDORD1"/>
                    <bitfield caption="Clock Phase" mask="0x02" name="UCPHA1"/>
                    <bitfield caption="Clock Polarity" mask="0x01" name="UCPOL1"/>
                </register>
            </register-group>
            <value-group caption="" name="SPI_CPOL_BITF">
                <value caption="Rising (Leading Edge), Falling (Trailing Edge)" name="VAL_0" value="0"/>
                <value caption="Falling (Leading Egde), Rising (Trailing Edge)" name="VAL_1" value="1"/>
            </value-group>
            <value-group caption="" name="SPI_CPHA_BITF">
                <value caption="Sample (Leading Edge), Setup (Trailing Edge)" name="VAL_0" value="0"/>
                <value caption="Setup (Leading Edge), Sample (Trailing Edge)" name="VAL_1" value="1"/>
            </value-group>
            <value-group caption="" name="COMM_SCK_RATE_SPI2X">
                <value caption="fosc/4 / fosc/2 (SPI2X=0/1)" name="VAL_0x00" value="0x00"/>
                <value caption="fosc/16 / fosc/8 (SPI2X=0/1)" name="VAL_0x01" value="0x01"/>
                <value caption="fosc/64 / fosc/32 (SPI2X=0/1)" name="VAL_0x02" value="0x02"/>
                <value caption="fosc/128 / fosc/64 (SPI2X=0/1)" name="VAL_0x03" value="0x03"/>
            </value-group>
        </module>
        <module caption="I/O Port" name="PORT">
            <register-group caption="I/O Port" name="PORTA">
                <register caption="Port A Data Register" name="PORTA" offset="0x22" size="1" mask="0xFF"/>
                <register caption="Port A Data Direction Register" name="DDRA" offset="0x21" size="1" mask="0xFF"/>
