bloombloombloom/Bloom/src/Targets/Microchip/AVR/PartDescriptionFiles/AVR8/MEGA/ATMEGA2564RFR2.xml
                <register caption="AES Encryption and Decryption Key Buffer Register" name="AES_KEY" offset="0x13F"
                          size="1">
                    <bitfield caption="AES Encryption/Decryption Key Buffer" mask="0xFF" name="AES_KEY"/>
                </register>
                <register caption="Transceiver Status Register" name="TRX_STATUS" offset="0x141" size="1" ocd-rw="R">
                    <bitfield caption="CCA Algorithm Status" mask="0x80" name="CCA_DONE" values="CCA_DONE_bitf"/>
                    <bitfield caption="CCA Status Result" mask="0x40" name="CCA_STATUS" values="CCA_STATUS_bitf"/>
                    <bitfield caption="Test mode status" mask="0x20" name="TST_STATUS" values="TST_STATUS_bitf"/>
                    <bitfield caption="Transceiver Main Status" mask="0x1F" name="TRX_STATUS" values="TRX_STATUS_bitf"/>
                </register>
                <register caption="Transceiver State Control Register" name="TRX_STATE" offset="0x142" size="1">
                    <bitfield caption="Transaction Status" mask="0xE0" name="TRAC_STATUS" values="TRAC_STATUS_bitf"/>
                    <bitfield caption="State Control Command" mask="0x1F" name="TRX_CMD" values="TRX_CMD_bitf"/>
                </register>
                <register caption="Reserved" name="TRX_CTRL_0" offset="0x143" size="1">
                    <bitfield caption="Reserved" mask="0x80" name="Res7"/>
                    <bitfield caption="Enable Phase Measurement Unit" mask="0x40" name="PMU_EN"/>
                    <bitfield caption="Start of Phase Measurement Unit" mask="0x20" name="PMU_START"/>
                    <bitfield caption="PMU IF Inverse" mask="0x10" name="PMU_IF_INV"/>
                </register>
                <register caption="Transceiver Control Register 1" name="TRX_CTRL_1" offset="0x144" size="1">
                    <bitfield caption="External PA support enable" mask="0x80" name="PA_EXT_EN"/>
                    <bitfield caption="Connect Frame Start IRQ to TC1" mask="0x40" name="IRQ_2_EXT_EN"/>
                    <bitfield caption="Enable Automatic CRC Calculation" mask="0x20" name="TX_AUTO_CRC_ON"/>
                    <bitfield caption="Enable PLL TX filter" mask="0x10" name="PLL_TX_FLT"/>
                </register>
                <register caption="Transceiver Transmit Power Control Register" name="PHY_TX_PWR" offset="0x145"
                          size="1">
                    <bitfield caption="Transmit Power Setting" mask="0x0F" name="TX_PWR" values="TX_PWR_bitf"/>
                </register>
                <register caption="Receiver Signal Strength Indicator Register" name="PHY_RSSI" offset="0x146" size="1"
                          ocd-rw="R">
                    <bitfield caption="Received Frame CRC Status" mask="0x80" name="RX_CRC_VALID"
                              values="RX_CRC_VALID_bitf"/>
                    <bitfield caption="Random Value" mask="0x60" name="RND_VALUE"/>
                    <bitfield caption="Receiver Signal Strength Indicator" mask="0x1F" name="RSSI"
                              values="RSSI_VALUE_BITF"/>
                </register>
                <register caption="Transceiver Energy Detection Level Register" name="PHY_ED_LEVEL" offset="0x147"
                          size="1" ocd-rw="R">
                    <bitfield caption="Energy Detection Level" mask="0xFF" name="ED_LEVEL" values="ED_LEVEL_BITF"/>
                </register>
                <register caption="Transceiver Clear Channel Assessment (CCA) Control Register" name="PHY_CC_CCA"
                          offset="0x148" size="1">
                    <bitfield caption="Manual CCA Measurement Request" mask="0x80" name="CCA_REQUEST"/>
                    <bitfield caption="Select CCA Measurement Mode" mask="0x60" name="CCA_MODE" values="CCA_MODE_bitf"/>
                    <bitfield caption="RX/TX Channel Selection" mask="0x1F" name="CHANNEL" values="CHANNEL_bitf"/>
                </register>
                <register caption="Transceiver CCA Threshold Setting Register" name="CCA_THRES" offset="0x149" size="1">
                    <bitfield caption="CS Threshold Level for CCA Measurement" mask="0xF0" name="CCA_CS_THRES"/>
                    <bitfield caption="ED Threshold Level for CCA Measurement" mask="0x0F" name="CCA_ED_THRES"/>
                </register>
                <register caption="Transceiver Receive Control Register" name="RX_CTRL" offset="0x14A" size="1">
                    <bitfield caption="Receiver Sensitivity Control" mask="0x0F" name="PDT_THRES"
                              values="PDT_THRES_bitf"/>
                </register>
                <register caption="Start of Frame Delimiter Value Register" name="SFD_VALUE" offset="0x14B" size="1">
                    <bitfield caption="Start of Frame Delimiter Value" mask="0xFF" name="SFD_VALUE"
                              values="SFD_VALUE_BITF"/>
                </register>
                <register caption="Transceiver Control Register 2" name="TRX_CTRL_2" offset="0x14C" size="1">
                    <bitfield caption="RX Safe Mode" mask="0x80" name="RX_SAFE_MODE"/>
                    <bitfield caption="Data Rate Selection" mask="0x03" name="OQPSK_DATA_RATE"
                              values="OQPSK_DATA_RATE_bitf"/>
                </register>
                <register caption="Antenna Diversity Control Register" name="ANT_DIV" offset="0x14D" size="1">
                    <bitfield caption="Antenna Diversity Antenna Status" mask="0x80" name="ANT_SEL"
                              values="ANT_SEL_bitf"/>
                    <bitfield caption="Enable Antenna Diversity" mask="0x08" name="ANT_DIV_EN"
                              values="ANT_DIV_EN_bitf"/>
                    <bitfield caption="Enable External Antenna Switch Control" mask="0x04" name="ANT_EXT_SW_EN"
                              values="ANT_EXT_SW_EN_bitf"/>
                    <bitfield caption="Static Antenna Diversity Switch Control" mask="0x03" name="ANT_CTRL"
                              values="ANT_CTRL_bitf"/>
                </register>
                <register caption="Transceiver Interrupt Enable Register" name="IRQ_MASK" offset="0x14E" size="1">
                    <bitfield caption="Awake Interrupt Enable" mask="0x80" name="AWAKE_EN"/>
                    <bitfield caption="TX_END Interrupt Enable" mask="0x40" name="TX_END_EN"/>
                    <bitfield caption="Address Match Interrupt Enable" mask="0x20" name="AMI_EN"/>
                    <bitfield caption="End of ED Measurement Interrupt Enable" mask="0x10" name="CCA_ED_DONE_EN"/>
                    <bitfield caption="RX_END Interrupt Enable" mask="0x08" name="RX_END_EN"/>
                    <bitfield caption="RX_START Interrupt Enable" mask="0x04" name="RX_START_EN"/>
                    <bitfield caption="PLL Unlock Interrupt Enable" mask="0x02" name="PLL_UNLOCK_EN"/>
                    <bitfield caption="PLL Lock Interrupt Enable" mask="0x01" name="PLL_LOCK_EN"/>
                </register>
                <register caption="Transceiver Interrupt Status Register" name="IRQ_STATUS" offset="0x14F" size="1">
                    <bitfield caption="Awake Interrupt Status" mask="0x80" name="AWAKE"/>
                    <bitfield caption="TX_END Interrupt Status" mask="0x40" name="TX_END"/>
                    <bitfield caption="Address Match Interrupt Status" mask="0x20" name="AMI"/>
                    <bitfield caption="End of ED Measurement Interrupt Status" mask="0x10" name="CCA_ED_DONE"/>
                    <bitfield caption="RX_END Interrupt Status" mask="0x08" name="RX_END"/>
                    <bitfield caption="RX_START Interrupt Status" mask="0x04" name="RX_START"/>
                    <bitfield caption="PLL Unlock Interrupt Status" mask="0x02" name="PLL_UNLOCK"/>
                    <bitfield caption="PLL Lock Interrupt Status" mask="0x01" name="PLL_LOCK"/>
                </register>
                <register caption="Transceiver Interrupt Enable Register 1" name="IRQ_MASK1" offset="0xBE" size="1">
                    <bitfield caption="Reserved Bit" mask="0xE0" name="Res"/>
                    <bitfield caption="Address Match Interrupt enable Address filter 3" mask="0x10"
                              name="MAF_3_AMI_EN"/>
                    <bitfield caption="Address Match Interrupt enable Address filter 2" mask="0x08"
                              name="MAF_2_AMI_EN"/>
                    <bitfield caption="Address Match Interrupt enable Address filter 1" mask="0x04"
                              name="MAF_1_AMI_EN"/>
                    <bitfield caption="Address Match Interrupt enable Address filter 0" mask="0x02"
                              name="MAF_0_AMI_EN"/>
                    <bitfield caption="Transmit Start Interrupt enable" mask="0x01" name="TX_START_EN"/>
                </register>
                <register caption="Transceiver Interrupt Status Register 1" name="IRQ_STATUS1" offset="0xBF" size="1">
                    <bitfield caption="Reserved Bit" mask="0xE0" name="Res"/>
                    <bitfield caption="Address Match Interrupt Status Address filter 3" mask="0x10" name="MAF_3_AMI"/>
                    <bitfield caption="Address Match Interrupt Status Address filter 2" mask="0x08" name="MAF_2_AMI"/>
                    <bitfield caption="Address Match Interrupt Status Address filter 1" mask="0x04" name="MAF_1_AMI"/>
                    <bitfield caption="Address Match Interrupt Status Address filter 0" mask="0x02" name="MAF_0_AMI"/>
                    <bitfield caption="Transmit Start Interrupt Status" mask="0x01" name="TX_START"/>
                </register>
