bloombloombloom/Bloom/src/Targets/Microchip/AVR/PartDescriptionFiles/AVR8/MEGA/ATMEGA2564RFR2.xml
                <register caption="Transceiver MAC Short Address Register (High Byte)" name="SHORT_ADDR_1"
                          offset="0x161" size="1">
                    <bitfield caption="MAC Short Address" mask="0xFF" name="SHORT_ADDR_" lsb="10"/>
                </register>
                <register caption="Transceiver Personal Area Network ID Register (Low Byte)" name="PAN_ID_0"
                          offset="0x162" size="1">
                    <bitfield caption="MAC Personal Area Network ID" mask="0x80" name="PAN_ID_07"/>
                    <bitfield caption="MAC Personal Area Network ID" mask="0x40" name="PAN_ID_06"/>
                    <bitfield caption="MAC Personal Area Network ID" mask="0x20" name="PAN_ID_05"/>
                    <bitfield caption="MAC Personal Area Network ID" mask="0x10" name="PAN_ID_04"/>
                    <bitfield caption="MAC Personal Area Network ID" mask="0x08" name="PAN_ID_03"/>
                    <bitfield caption="MAC Personal Area Network ID" mask="0x04" name="PAN_ID_02"/>
                    <bitfield caption="MAC Personal Area Network ID" mask="0x02" name="PAN_ID_01"/>
                    <bitfield caption="MAC Personal Area Network ID" mask="0x01" name="PAN_ID_00"/>
                </register>
                <register caption="Transceiver Personal Area Network ID Register (High Byte)" name="PAN_ID_1"
                          offset="0x163" size="1">
                    <bitfield caption="MAC Personal Area Network ID" mask="0xFF" name="PAN_ID_" lsb="10"/>
                </register>
                <register caption="Transceiver MAC IEEE Address Register 0" name="IEEE_ADDR_0" offset="0x164" size="1">
                    <bitfield caption="MAC IEEE Address" mask="0x80" name="IEEE_ADDR_07"/>
                    <bitfield caption="MAC IEEE Address" mask="0x40" name="IEEE_ADDR_06"/>
                    <bitfield caption="MAC IEEE Address" mask="0x20" name="IEEE_ADDR_05"/>
                    <bitfield caption="MAC IEEE Address" mask="0x10" name="IEEE_ADDR_04"/>
                    <bitfield caption="MAC IEEE Address" mask="0x08" name="IEEE_ADDR_03"/>
                    <bitfield caption="MAC IEEE Address" mask="0x04" name="IEEE_ADDR_02"/>
                    <bitfield caption="MAC IEEE Address" mask="0x02" name="IEEE_ADDR_01"/>
                    <bitfield caption="MAC IEEE Address" mask="0x01" name="IEEE_ADDR_00"/>
                </register>
                <register caption="Transceiver MAC IEEE Address Register 1" name="IEEE_ADDR_1" offset="0x165" size="1">
                    <bitfield caption="MAC IEEE Address" mask="0xFF" name="IEEE_ADDR_" lsb="10"/>
                </register>
                <register caption="Transceiver MAC IEEE Address Register 2" name="IEEE_ADDR_2" offset="0x166" size="1">
                    <bitfield caption="MAC IEEE Address" mask="0xFF" name="IEEE_ADDR_" lsb="20"/>
                </register>
                <register caption="Transceiver MAC IEEE Address Register 3" name="IEEE_ADDR_3" offset="0x167" size="1">
                    <bitfield caption="MAC IEEE Address" mask="0xFF" name="IEEE_ADDR_" lsb="30"/>
                </register>
                <register caption="Transceiver MAC IEEE Address Register 4" name="IEEE_ADDR_4" offset="0x168" size="1">
                    <bitfield caption="MAC IEEE Address" mask="0xFF" name="IEEE_ADDR_" lsb="40"/>
                </register>
                <register caption="Transceiver MAC IEEE Address Register 5" name="IEEE_ADDR_5" offset="0x169" size="1">
                    <bitfield caption="MAC IEEE Address" mask="0xFF" name="IEEE_ADDR_" lsb="50"/>
                </register>
                <register caption="Transceiver MAC IEEE Address Register 6" name="IEEE_ADDR_6" offset="0x16A" size="1">
                    <bitfield caption="MAC IEEE Address" mask="0xFF" name="IEEE_ADDR_" lsb="60"/>
                </register>
                <register caption="Transceiver MAC IEEE Address Register 7" name="IEEE_ADDR_7" offset="0x16B" size="1">
                    <bitfield caption="MAC IEEE Address" mask="0xFF" name="IEEE_ADDR_" lsb="70"/>
                </register>
                <register caption="Transceiver Extended Operating Mode Control Register" name="XAH_CTRL_0"
                          offset="0x16C" size="1">
                    <bitfield caption="Maximum Number of Frame Re-transmission Attempts" mask="0xF0"
                              name="MAX_FRAME_RETRIES" values="MAX_FRAME_RETRIES_bitf"/>
                    <bitfield caption="Maximum Number of CSMA-CA Procedure Repetition Attempts" mask="0x0E"
                              name="MAX_CSMA_RETRIES" values="MAX_CSMA_RETRIES_bitf"/>
                    <bitfield caption="Set Slotted Acknowledgment" mask="0x01" name="SLOTTED_OPERATION"
                              values="SLOTTED_OPERATION_BITF"/>
                </register>
                <register caption="Transceiver CSMA-CA Random Number Generator Seed Register" name="CSMA_SEED_0"
                          offset="0x16D" size="1">
                    <bitfield caption="Seed Value for CSMA Random Number Generator" mask="0x80" name="CSMA_SEED_07"/>
                    <bitfield caption="Seed Value for CSMA Random Number Generator" mask="0x40" name="CSMA_SEED_06"/>
                    <bitfield caption="Seed Value for CSMA Random Number Generator" mask="0x20" name="CSMA_SEED_05"/>
                    <bitfield caption="Seed Value for CSMA Random Number Generator" mask="0x10" name="CSMA_SEED_04"/>
                    <bitfield caption="Seed Value for CSMA Random Number Generator" mask="0x08" name="CSMA_SEED_03"/>
                    <bitfield caption="Seed Value for CSMA Random Number Generator" mask="0x04" name="CSMA_SEED_02"/>
                    <bitfield caption="Seed Value for CSMA Random Number Generator" mask="0x02" name="CSMA_SEED_01"/>
                    <bitfield caption="Seed Value for CSMA Random Number Generator" mask="0x01" name="CSMA_SEED_00"/>
                </register>
                <register caption="Transceiver Acknowledgment Frame Control Register 2" name="CSMA_SEED_1"
                          offset="0x16E" size="1">
                    <bitfield caption="Acknowledgment Frame Filter Mode" mask="0xC0" name="AACK_FVN_MODE"
                              values="AACK_FVN_MODE_bitf"/>
                    <bitfield caption="Set Frame Pending Sub-field" mask="0x20" name="AACK_SET_PD"/>
                    <bitfield caption="Disable Acknowledgment Frame Transmission" mask="0x10" name="AACK_DIS_ACK"/>
                    <bitfield caption="Set Personal Area Network Coordinator" mask="0x08" name="AACK_I_AM_COORD"/>
                    <bitfield caption="Seed Value for CSMA Random Number Generator" mask="0x07" name="CSMA_SEED_1"/>
                </register>
